The titanic survival prediction uses the titanic dataset to predict if the passenger on the ship survived or not.

In [92]:
import pandas as pd
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score, recall_score, f1_score
from sklearn.metrics import roc_auc_score, classification_report

In [67]:
df = pd.read_csv(r"C:\Users\fatim\Downloads\tested.csv")

In [68]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In the above dataset it can be seen that we have a column of Survived having boolean type telling us if the passenger survived.

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [70]:
###Checking for null values

df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [71]:
df1 = df.drop(['Name','Cabin','Ticket'], axis = 1)

In [72]:
df1.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0          892         0       3    male  34.5      0      0   7.8292        Q
1          893         1       3  female  47.0      1      0   7.0000        S
2          894         0       2    male  62.0      0      0   9.6875        Q
3          895         0       3    male  27.0      0      0   8.6625        S
4          896         1       3  female  22.0      1      1  12.2875        S

In [75]:
#### Filling with mean
df1['Age'] = df1['Age'].fillna(df1['Age'].mean())
df1['Fare'] = df1['Fare'].fillna(df1['Fare'].mean())

In [78]:
df1.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

In [81]:
df1.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Sex             object
Age            float64
SibSp            int64
Parch            int64
Fare           float64
Embarked        object
dtype: object

In [82]:
df1['Embarked'] = df1['Embarked'].map( {'Q': 0,'S':1,'C':2}).astype(int)
df1['Sex'] = df1['Sex'].map( {'female': 1,'male':0}).astype(int)

In [84]:
df1['Age'] = df1['Age'].astype(int)
df1['Fare'] = df1['Fare'].astype(int)

In [86]:
df1.dtypes

PassengerId    int64
Survived       int64
Pclass         int64
Sex            int32
Age            int32
SibSp          int64
Parch          int64
Fare           int32
Embarked       int32
dtype: object

                                           Splitting the data

In [87]:
y = df1['Survived']
X = df1.drop('Survived', axis=1)

In [88]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 42, stratify = y )
print("Shape of Training dataset: ", X_train.shape)
print("Shape of Testing dataset: ", X_test.shape)

Shape of Training dataset:  (334, 8)
Shape of Testing dataset:  (84, 8)

                                               Feature scaling

In [89]:
# Scaling our dataset 
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler.fit(X_train)
X_train_scaled = scaler.transform(X_train)
X_test_scaled = scaler.transform(X_test)

                                               Model Building

In [90]:
from sklearn.tree import DecisionTreeClassifier
dt_model = DecisionTreeClassifier(max_depth=5, random_state=42)
dt_model.fit(X_test_scaled, y_test)
y_pred = dt_model.predict(X_test_scaled)

In [93]:
dt_accuracy = accuracy_score(y_test,y_pred)
dt_recall = recall_score(y_test,y_pred)
dt_f1 = f1_score(y_test,y_pred, average='macro')
print("F1 SCORE: ", dt_f1)
print("Accuracy: " , dt_accuracy)

F1 SCORE:  1.0
Accuracy:  1.0

                                             Testing the model

In [94]:
df1

     PassengerId  Survived  Pclass  Sex  Age  SibSp  Parch  Fare  Embarked
0            892         0       3    0   34      0      0     7         0
1            893         1       3    1   47      1      0     7         1
2            894         0       2    0   62      0      0     9         0
3            895         0       3    0   27      0      0     8         1
4            896         1       3    1   22      1      1    12         1
..           ...       ...     ...  ...  ...    ...    ...   ...       ...
413         1305         0       3    0   30      0      0     8         1
414         1306         1       1    1   39      0      0   108         2
415         1307         0       3    0   38      0      0     7         1
416         1308         0       3    0   30      0      0     8         1
417         1309         0       3    0   30      1      1    22         2

[418 rows x 9 columns]

In [97]:
y_predict = dt_model.predict([[892,3,0,34,0,0,7,0]])
print(y_predict)
if y_predict==1:
    print("Survived")
else:
    print("Did not survived")

[0]
Did not survived